import { ServiceBlock } from './types'

export const blockList: ServiceBlock[] = [
    {
        svg: {
            width: 38,
            height: 38,
            viewBox: '0 0 38 38',
            fill: 'none',
            xmlns: 'http://www.w3.org/2000/svg',
            id: 'server-04',
            d: 'M34.8334 16.625L34.0822 10.6157C33.7876 8.25874 33.6403 7.08022 33.0856 6.19214C32.5969 5.40969 31.8909 4.78647 31.0539 4.39861C30.1039 3.95837 28.9162 3.95837 26.5409 3.95837H11.4592C9.08383 3.95837 7.89616 3.95837 6.94614 4.39861C6.10911 4.78647 5.40315 5.40969 4.91446 6.19214C4.35979 7.08022 4.21248 8.25872 3.91785 10.6157L3.16669 16.625M8.70835 22.9584H29.2917M8.70835 22.9584C5.64778 22.9584 3.16669 20.4773 3.16669 17.4167C3.16669 14.3561 5.64778 11.875 8.70835 11.875H29.2917C32.3523 11.875 34.8334 14.3561 34.8334 17.4167C34.8334 20.4773 32.3523 22.9584 29.2917 22.9584M8.70835 22.9584C5.64778 22.9584 3.16669 25.4395 3.16669 28.5C3.16669 31.5606 5.64778 34.0417 8.70835 34.0417H29.2917C32.3523 34.0417 34.8334 31.5606 34.8334 28.5C34.8334 25.4395 32.3523 22.9584 29.2917 22.9584M9.50002 17.4167H9.51585M9.50002 28.5H9.51585M19 17.4167H28.5M19 28.5H28.5',
            stroke: '#AEAEAE',
            strokeWidth: 3,
            strokeLinecap: 'round',
            strokeLinejoin: 'round',
        },
        alt: 'server',
        text: 'Предоставим удалённый сервер',
        textClass: 'block-text_first',
    },
    {
        svg: {
            width: 39,
            height: 38,
            viewBox: '0 0 39 38',
            fill: 'none',
            xmlns: 'http://www.w3.org/2000/svg',
            id: 'server-04',
            d: 'M22.6666 17.4167H13.1666M16.3333 23.7501H13.1666M25.8333 11.0834H13.1666M32.1666 15.8334V10.7667C32.1666 8.1065 32.1666 6.77637 31.6489 5.76029C31.1935 4.86652 30.4669 4.13987 29.5731 3.68447C28.557 3.16675 27.2269 3.16675 24.5666 3.16675H14.4333C11.7731 3.16675 10.4429 3.16675 9.42686 3.68447C8.53309 4.13987 7.80643 4.86652 7.35103 5.76029C6.83331 6.77637 6.83331 8.1065 6.83331 10.7667V27.2334C6.83331 29.8937 6.83331 31.2238 7.35103 32.2399C7.80643 33.1336 8.53309 33.8603 9.42686 34.3157C10.4429 34.8334 11.7731 34.8334 14.4333 34.8334H20.2916M29 33.2501C29 33.2501 33.75 30.9861 33.75 27.59V23.628L30.2863 22.3903C29.4541 22.0922 28.544 22.0922 27.7118 22.3903L24.25 23.628V27.59C24.25 30.9861 29 33.2501 29 33.2501Z',
            stroke: '#AEAEAE',
            strokeWidth: 3,
            strokeLinecap: 'round',
            strokeLinejoin: 'round',
        },
        alt: 'file-shield',
        text: 'Перенесём IT-инфраструктуру и данные в безопасное место',
        textClass: 'block-text',
    },
    {
        svg: {
            width: 38,
            height: 38,
            viewBox: '0 0 38 38',
            fill: 'none',
            xmlns: 'http://www.w3.org/2000/svg',
            id: 'server-04',
            d: 'M19.0001 24.5417H11.8751C9.66544 24.5417 8.56062 24.5417 7.66161 24.8144C5.63747 25.4284 4.05348 27.0124 3.43946 29.0365C3.16675 29.9355 3.16675 31.0404 3.16675 33.25M25.3334 28.5L28.5001 31.6667L34.8334 25.3333M22.9584 11.875C22.9584 15.81 19.7684 19 15.8334 19C11.8984 19 8.70842 15.81 8.70842 11.875C8.70842 7.93997 11.8984 4.75 15.8334 4.75C19.7684 4.75 22.9584 7.93997 22.9584 11.875Z',
            stroke: '#AEAEAE',
            strokeWidth: 3.33333,
            strokeLinecap: 'round',
            strokeLinejoin: 'round',
        },
        alt: 'user-check',
        text: 'Возьмём на контроль учётные записи сотрудников',
        textClass: 'block-text',
    },
    {
        svg: {
            width: 38,
            height: 38,
            viewBox: '0 0 38 38',
            fill: 'none',
            xmlns: 'http://www.w3.org/2000/svg',
            id: 'server-04',
            d: 'M17.4167 7.12508H28.9751C30.7486 7.12508 31.6353 7.12508 32.3127 7.47023C32.9086 7.77383 33.393 8.25827 33.6966 8.85411C34.0418 9.5315 34.0418 10.4182 34.0418 12.1917V14.2501C34.0418 15.7256 34.0418 16.4633 33.8007 17.0452C33.4793 17.8212 32.8628 18.4376 32.0869 18.759C31.505 19.0001 30.7672 19.0001 29.2918 19.0001M20.5834 30.8751H9.02508C7.25158 30.8751 6.36483 30.8751 5.68744 30.5299C5.0916 30.2263 4.60716 29.7419 4.30356 29.1461C3.95841 28.4687 3.95841 27.5819 3.95841 25.8084V23.7501C3.95841 22.2746 3.95841 21.5369 4.19946 20.9549C4.52086 20.179 5.13733 19.5625 5.91325 19.2411C6.49519 19.0001 7.23293 19.0001 8.70842 19.0001M16.3084 22.9584H21.6917C22.1351 22.9584 22.3568 22.9584 22.5262 22.8721C22.6751 22.7962 22.7962 22.6751 22.8721 22.5262C22.9584 22.3568 22.9584 22.1351 22.9584 21.6917V16.3084C22.9584 15.865 22.9584 15.6434 22.8721 15.474C22.7962 15.325 22.6751 15.2039 22.5262 15.128C22.3568 15.0417 22.1351 15.0417 21.6917 15.0417H16.3084C15.865 15.0417 15.6434 15.0417 15.474 15.128C15.325 15.2039 15.2039 15.325 15.128 15.474C15.0417 15.6434 15.0417 15.865 15.0417 16.3084V21.6917C15.0417 22.1351 15.0417 22.3568 15.128 22.5262C15.2039 22.6751 15.325 22.7962 15.474 22.8721C15.6434 22.9584 15.865 22.9584 16.3084 22.9584ZM28.1834 34.8334H33.5668C34.0101 34.8334 34.2318 34.8334 34.4012 34.7471C34.5501 34.6712 34.6712 34.5501 34.7471 34.4012C34.8334 34.2318 34.8334 34.0101 34.8334 33.5668V28.1834C34.8334 27.74 34.8334 27.5184 34.7471 27.349C34.6712 27.2 34.5501 27.0789 34.4012 27.003C34.2318 26.9168 34.0101 26.9168 33.5668 26.9168H28.1834C27.74 26.9168 27.5184 26.9168 27.349 27.003C27.2 27.0789 27.0789 27.2 27.003 27.349C26.9168 27.5184 26.9168 27.74 26.9168 28.1834V33.5668C26.9168 34.0101 26.9168 34.2318 27.003 34.4012C27.0789 34.5501 27.2 34.6712 27.349 34.7471C27.5184 34.8334 27.74 34.8334 28.1834 34.8334ZM4.43342 11.0834H9.81675C10.2601 11.0834 10.4818 11.0834 10.6512 10.9971C10.8001 10.9212 10.9212 10.8001 10.9971 10.6512C11.0834 10.4818 11.0834 10.2601 11.0834 9.81675V4.43341C11.0834 3.99004 11.0834 3.76835 10.9971 3.59901C10.9212 3.45004 10.8001 3.32893 10.6512 3.25303C10.4818 3.16675 10.2601 3.16675 9.81675 3.16675H4.43341C3.99004 3.16675 3.76835 3.16675 3.59901 3.25303C3.45004 3.32893 3.32893 3.45004 3.25303 3.59901C3.16675 3.76835 3.16675 3.99004 3.16675 4.43342V9.81675C3.16675 10.2601 3.16675 10.4818 3.25303 10.6512C3.32893 10.8001 3.45004 10.9212 3.59901 10.9971C3.76835 11.0834 3.99004 11.0834 4.43342 11.0834Z',
            stroke: '#AEAEAE',
            strokeWidth: 3.33333,
            strokeLinecap: 'round',
            strokeLinejoin: 'round',
        },
        alt: 'dataflow',
        text: 'Зашифруем каналы передачи данных',
        textClass: 'block-text',
    }
]

export const slides = [
    {
        image: './src/assets/Server-rafiki.svg',
        alt: 'Slide 1',
        title: 'Уже столкнулись с проблемой кибербезопасности?',
        subtitle: 'Кому подойдет Lard Defender?',
        text: 'Срочно проанализируем вашу систему и подберем необходимое защитное ПО: закройте все уязвимости и отслеживайте возможные угрозы.',
    },
    {
        image: './src/assets/growth.svg',
        alt: 'Slide 2',
        title: 'Взрывной рост бизнеса привлекает внимание злоумышленников?',
        subtitle: 'Кому подойдет Lard Defender?',
        text: 'Не дадим ценной информации попасть в руки недоброжелателей: мгновенно стирайте ее с носителей и восстанавливайте за пару кликов.',
    },
    {
        image: './src/assets/goout.svg',
        alt: 'Slide 3',
        title: 'Лояльность сотрудников вызывает сомнения?',
        subtitle: 'Кому подойдет Lard Defender?',
        text: 'Внедрим ПО для защиты от утечек. Больше не беспокойтесь о безопасности ваших данных — попытки выкрасть информацию будут предотвращены.',
    },
    {
        image: './src/assets/meditation.svg',
        alt: 'Slide 4',
        title: 'IT-отдел не справляется?Внедрять сервисы киберзащиты сложно?',
        subtitle: 'Кому подойдет Lard Defender?',
        text: 'Интегрируем самые передовые решения без привлечения ваших кадровых ресурсов.',
    }
]

export const reviews = [
    {
        image: './src/assets/commentator1.png',
        alt: 'Slide 1',
        text: 'Благодаря компетентной и оперативной работе коллектива ЛАРД, нам были предоставлены запрашиваемые услуги и решения возникших задач в ожидаемые сроки.',
        name: 'Глибин Антон Алексеевич',
        role: 'Генеральный директор'
    },
    {
        image: './src/assets/commentator2.png',
        alt: 'Slide 2',
        text: 'Хочу выразить слова благодарности, нашему постоянному партнеру, уже ставшему другом, компании «ЛАРД».',
        name: 'Богданова Анна Геннадьевна',
        role: 'Head of PR "Твой Продюсер", Comedy Concert и Comedy Place'
    },
    {
        image: './src/assets/commentator3.png',
        alt: 'Slide 3',
        text: 'Благодарим Вашу команду за высокий уровень профессионализма и плодотворное сотрудничество! Благодаря внедрению МИС.',
        name: 'Иванцова Ольга Владимировна',
        role: 'Генеральный директор сети мед-центров ООО “МедПроф”'
    },
    {
        image: './src/assets/commentator4.png',
        alt: 'Slide 4',
        text: 'ООО Санерити выражает благодарность руководству и всему коллективу ООО ЛАРД за профессиональное сотрудничество в области разработки ПО.',
        name: 'Глибин Антон Алексеевич',
        role: 'Генеральный директор Sanerity'
    },
    {
        image: './src/assets/commentator5.png',
        alt: 'Slide 5',
        text: 'Хочу выразить слова благодарности, нашему постоянному партнеру, уже ставшему другом, компании «ЛАРД».',
        name: 'Иванцова Ольга Владимировна',
        role: 'Генеральный директор ООО “Охрана труда”'
    },
]